In [ ]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [ ]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [ ]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [ ]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.433995       NaN       NaN
1  0.267462       NaN       NaN
2 -0.556242       NaN  0.178580
3  0.808382       NaN -0.764808
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
df.dropna()

          0         1         2
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
df.dropna(thresh=2)

          0         1         2
2 -0.556242       NaN  0.178580
3  0.808382       NaN -0.764808
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
df.fillna(0)

          0         1         2
0  0.433995  0.000000  0.000000
1  0.267462  0.000000  0.000000
2 -0.556242  0.000000  0.178580
3  0.808382  0.000000 -0.764808
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.433995  0.500000  0.000000
1  0.267462  0.500000  0.000000
2 -0.556242  0.500000  0.178580
3  0.808382  0.500000 -0.764808
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.433995  0.000000  0.000000
1  0.267462  0.000000  0.000000
2 -0.556242  0.000000  0.178580
3  0.808382  0.000000 -0.764808
4  0.316958 -1.611566 -0.900395
5  0.666147  0.469969  0.486021
6  1.448033 -0.953801 -0.414354

In [ ]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.885062 -0.144022 -1.161074
1  0.674628 -1.763583  0.466262
2 -0.514522       NaN -1.519534
3 -0.756187       NaN -0.276320
4 -1.697925       NaN       NaN
5  0.490138       NaN       NaN

In [ ]:
df.fillna(method='ffill')

          0         1         2
0 -0.885062 -0.144022 -1.161074
1  0.674628 -1.763583  0.466262
2 -0.514522 -1.763583 -1.519534
3 -0.756187 -1.763583 -0.276320
4 -1.697925 -1.763583 -0.276320
5  0.490138 -1.763583 -0.276320

In [ ]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.885062 -0.144022 -1.161074
1  0.674628 -1.763583  0.466262
2 -0.514522 -1.763583 -1.519534
3 -0.756187 -1.763583 -0.276320
4 -1.697925       NaN -0.276320
5  0.490138       NaN -0.276320

In [ ]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [ ]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [ ]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [ ]:
data.rename(index={'OHIO': 'INDIANA'},
 columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [ ]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

Discretization and Binning

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [ ]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
group_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [ ]:
data = np.random.rand(20)
data

array([0.73297528, 0.16939418, 0.60081199, 0.90509887, 0.27733471,
       0.88548884, 0.49402637, 0.40969711, 0.96016154, 0.88295617,
       0.25178118, 0.71119359, 0.45265134, 0.26959091, 0.55207573,
       0.04679596, 0.86651646, 0.60601233, 0.34617792, 0.93458575])

In [ ]:
pd.cut(data, 4, precision=2)

[(0.73, 0.96], (0.046, 0.28], (0.5, 0.73], (0.73, 0.96], (0.28, 0.5], ..., (0.046, 0.28], (0.73, 0.96], (0.5, 0.73], (0.28, 0.5], (0.73, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.046, 0.28] < (0.28, 0.5] < (0.5, 0.73] < (0.73, 0.96]]

In [ ]:
data = np.random.randn(1000)
data

array([-1.43987356e+00,  6.38518744e-01,  1.19986557e-01,  1.63875867e-01,
        1.17314158e-01,  2.24662932e-01, -1.78286113e+00, -2.98412051e-01,
        1.12433670e+00,  2.54272188e-01,  1.54258234e+00, -8.29383144e-01,
       -1.03520947e+00, -1.55387871e-02,  6.86575004e-01, -1.00451425e+00,
        5.64375896e-01,  1.66167264e+00,  7.84153898e-02,  1.34509982e+00,
        1.15493507e+00, -1.64114028e+00, -2.87424640e-01,  1.30054978e+00,
        2.93370424e+00,  1.02701078e+00,  1.32438216e+00,  1.24903687e-01,
        2.75222285e-01, -9.29986418e-01, -9.67917456e-01, -1.08090814e+00,
       -1.30296152e+00,  1.55584310e-01, -2.11014823e+00,  8.53170893e-01,
       -4.41725908e-01,  1.27236270e+00,  3.45322190e-01, -1.19383189e+00,
       -4.11382942e-01,  4.10151080e-01,  1.04390847e+00,  3.48408998e-01,
       -2.20676326e-01,  3.55507639e-01, -1.03383609e+00,  1.46201023e+00,
        4.60720914e-02, -1.15832930e+00, -2.63570918e-01,  4.73220066e-01,
       -6.43489494e-01, -1.59838350e+00, -1.14005426e+00, -4.32891798e-02,
       -3.27607740e-01,  8.31085428e-01, -8.89228386e-01,  1.35628616e+00,
        1.00155038e+00, -1.48259825e+00,  3.98880129e-01,  9.13843126e-02,
        7.86778928e-02, -3.05096080e-01, -1.30741272e+00, -2.12238113e-01,
        3.04637829e-01, -1.74792773e+00,  5.07078049e-01, -7.98241842e-01,
       -1.48655642e+00,  6.07185349e-01,  3.92586446e-03, -1.35632752e+00,
        6.60950829e-01, -1.78628383e+00,  5.26187738e-01,  1.16999348e+00,
       -1.29847645e+00,  1.23473362e+00,  2.01668989e-01, -2.41052701e+00,
       -5.74813109e-01, -6.73907290e-01,  2.72080734e-01, -1.24731092e+00,
       -1.54754253e+00, -6.88541053e-02, -7.44783772e-01, -9.13756321e-01,
       -5.52934023e-01,  9.47176197e-02,  7.30569903e-01,  8.20464624e-02,
        4.92863113e-01,  9.50046962e-01, -1.08405785e+00, -5.35977756e-01,
        1.16002078e+00, -1.27188562e+00,  6.24006912e-01, -5.64139167e-01,
       -6.47691076e-01, -1.07262564e+00,  1.48940808e+00, -2.36804209e+00,
       -1.47020790e+00, -2.17062908e-01,  1.76332843e+00, -8.53386392e-02,
       -5.59162903e-01,  6.77470428e-01,  1.68252157e-01, -2.12143518e+00,
       -1.26732785e+00,  2.60845320e-01,  7.19241878e-01,  5.76116208e-01,
        7.60007086e-01,  8.64320686e-01,  7.62781577e-01, -1.46313657e+00,
        6.77658620e-01, -1.46769398e+00,  1.97006513e+00, -6.54233209e-01,
        1.47283910e+00, -6.66548420e-01,  5.56691942e-01,  8.44739255e-01,
        2.54142374e-01, -3.95845337e-01, -9.96630851e-01,  1.39863147e+00,
       -6.97081475e-01, -3.35049767e-01, -3.85524037e-01, -3.08812093e-01,
       -8.30546340e-01, -1.36803733e+00, -9.95227524e-01, -4.90682024e-01,
        2.88128981e+00, -1.51736373e+00,  8.06268655e-01,  1.15887660e+00,
       -7.87798409e-01, -1.33161797e+00,  9.78399436e-02,  8.00930729e-01,
       -7.52882672e-01, -4.57082202e-01, -3.95884636e-01,  2.87792712e+00,
        8.48031581e-01,  1.17499757e+00, -1.74329615e-01,  3.87447702e-01,
       -2.61025592e+00,  1.53870142e+00, -1.16861819e-01,  5.95617641e-01,
        6.22578027e-01,  3.64206430e-02,  5.65883623e-01, -1.52278381e-02,
        2.21623114e-01, -7.16311454e-01, -1.27519541e+00,  5.23408003e-01,
       -5.18919753e-01, -1.35463990e+00, -1.34442911e+00,  3.58431309e-01,
       -5.91902812e-01, -3.63199920e-01,  1.97082670e-01,  7.45245622e-01,
       -4.54447899e-01,  7.74822556e-01, -1.99151799e-01, -1.59792849e+00,
       -4.91484670e-01,  8.67057729e-01, -5.91044400e-01, -1.28405370e+00,
        8.35045737e-01,  4.96672459e-01,  5.11391080e-01, -1.76677210e+00,
       -1.35433424e+00, -3.82062331e-01, -7.47267820e-01, -1.55808074e-01,
        2.79634322e-01,  1.41531493e-01,  1.26734998e+00, -8.30120479e-01,
       -1.64263891e+00, -9.58119593e-01, -1.24954210e+00,  2.15587807e+00,
       -2.19987201e-01, -9.19205340e-01, -2.83164819e-01, -2.39613195e+00,
        6.15021513e-01,  5.18666228e-01,  6.44570580e-01, -2.88314044e+00,
       -3.48295075e-01,  4.14483506e-01,  3.85465487e-01, -4.75558834e-01,
       -5.90051200e-01,  5.42729451e-01, -5.35475996e-01,  7.41401430e-01,
        1.33740244e-01, -7.34457861e-01, -5.62142673e-01,  2.01390564e+00,
        2.59767029e+00,  2.72987063e+00,  1.97251648e+00, -3.18621300e-01,
        2.03208361e+00,  1.51439839e+00,  9.73162568e-01, -3.83940844e-02,
        1.00595265e+00, -1.28234829e+00, -2.46796142e+00,  1.00909351e-01,
        1.89433483e-01, -6.80097077e-02,  4.20085214e-01,  3.55918726e-02,
       -1.74602569e-01,  1.14601160e-01, -1.62082888e-01, -3.36556342e-01,
       -3.20592868e-01,  8.00383535e-01,  4.90087355e-01,  3.49656158e-01,
       -5.20527747e-01,  2.22763978e-01,  6.42264428e-01,  1.27395588e+00,
        7.58806706e-01,  2.87894525e+00,  1.44220235e+00, -2.49108790e-01,
        1.56748940e+00,  1.93781476e-01,  3.39604737e-01, -1.23987723e+00,
        1.39943854e+00,  2.07222574e-01,  1.32358632e+00, -2.32726478e+00,
       -1.29075824e+00, -1.87315350e+00,  7.40721671e-01,  7.59860260e-01,
        6.22456992e-01,  6.89403628e-01, -1.09193035e+00,  7.98033192e-01,
        3.22447154e-01, -2.27523598e-01, -3.21040448e-01,  3.29456427e-01,
       -1.21678879e+00,  1.32040059e+00, -3.75253389e-02, -9.98773284e-01,
       -1.44801278e+00,  1.18866030e+00, -1.54808403e+00,  5.31066280e-03,
       -3.05623220e-01,  1.09733375e+00,  3.90864953e-01, -6.26621327e-01,
        2.32935509e+00,  3.02980686e-01, -1.08188343e-01, -3.70924856e-01,
       -1.25369671e+00,  6.64447558e-01,  2.95617897e-01, -8.02030830e-01,
        6.90613970e-01,  5.73728902e-01, -1.90378064e+00,  4.42362208e-02,
       -2.40090201e+00,  5.37984074e-01,  2.56163674e-01,  6.85598402e-01,
        3.80443778e-01, -3.94074475e-02,  1.10968622e+00, -3.89268904e-01,
       -8.90008055e-01, -8.04631761e-01,  1.32550155e-01,  7.34236533e-02,
       -4.23648636e-01,  1.59856220e+00, -3.95996085e-01, -1.81812362e-01,
        3.77137099e-01, -1.06412279e+00, -1.91597696e+00, -7.09103521e-01,
        1.23993062e+00, -5.25381277e-01, -6.31384189e-01,  4.50757893e-01,
        1.48778261e+00,  7.69949560e-01, -7.34974846e-01,  5.91691247e-01,
        7.40623100e-01, -5.14980172e-01,  2.23908512e-01, -7.41558078e-01,
       -8.57406288e-01,  1.23082700e+00, -2.04352190e+00,  1.08289091e+00,
        5.13859541e-02, -1.46865170e+00, -1.34406683e+00, -8.77446144e-01,
       -1.49552619e+00,  1.32803777e+00,  1.05194821e+00,  9.72838903e-01,
        5.44254202e-01,  1.62001076e+00,  1.18720556e+00,  5.18471750e-01,
        9.61013471e-01,  1.71463729e+00, -3.32640327e-01, -2.00114235e-03,
        1.47928901e-02,  3.81475330e-01, -1.02943235e+00,  1.44901123e+00,
       -2.89490598e-01, -5.49475392e-01, -1.49953857e+00,  4.00984125e-01,
        2.40250555e-03, -1.64093334e+00,  1.25527631e+00,  6.23539264e-01,
        4.05988884e-01,  4.80340368e-01, -4.27731003e-01,  4.70959698e-01,
       -8.74397618e-01,  6.85789225e-01, -1.30695039e-01,  1.87895538e+00,
       -3.56650994e-01, -8.73990553e-02,  3.30160791e-01,  1.05536547e+00,
        1.26785580e+00,  1.40275952e+00, -2.07590386e-01,  7.04452978e-01,
        1.46686937e+00,  9.17637597e-01,  2.59554351e-01, -1.43322094e-01,
       -1.86662228e+00, -1.26926248e-01, -2.76785578e-02,  1.14168803e+00,
       -6.20837558e-01,  4.41457834e-01, -7.51389083e-02, -9.70363211e-01,
       -2.17543053e+00,  1.70957640e+00, -6.99565161e-01,  1.58594832e+00,
        3.05238991e-01,  1.07938271e-01, -1.02682655e-01,  8.66051213e-01,
        9.01706122e-01, -2.27838167e-01,  9.49812581e-01, -2.57248972e-01,
        5.80068417e-01, -2.10329095e-01, -4.42293537e-02,  1.83754605e+00,
       -2.82462871e-01, -3.74931149e-01, -2.67017304e-01,  4.85987299e-01,
        1.44385961e+00,  4.58247255e-01,  3.31824966e-01, -5.45244836e-01,
       -6.44461216e-01,  7.30756550e-01, -4.81028358e-01,  2.99014395e-01,
        5.24795011e-01,  3.08465811e-01, -1.41630987e-01, -3.13466833e-01,
       -1.60979739e+00, -1.11542812e+00, -9.21848990e-01,  2.16264536e-01,
        2.33017583e+00,  3.71496104e-02, -5.72878058e-01,  4.36456434e-02,
       -1.31537790e+00,  4.16723249e-01, -2.83804358e-01,  2.20948218e-02,
       -5.96498870e-02, -6.55665119e-01, -1.51356733e+00, -7.30894771e-01,
       -7.96325375e-02, -1.19590826e+00,  4.00225017e-01,  1.07507020e+00,
        3.74287706e-01, -3.54791002e-01, -6.03076196e-01, -1.58801542e+00,
        2.92825660e-01, -1.06694407e+00, -1.04922679e+00, -1.54017115e+00,
       -1.69563959e+00, -4.84714152e-01,  4.83987444e-01, -3.00069473e-01,
        4.61714428e-01,  1.87002846e+00, -3.58832413e-01,  2.42833878e-01,
        1.42080699e+00, -6.77606635e-01,  3.08337011e-01, -1.38930526e+00,
        5.09556335e-01,  7.70507425e-01,  4.95767763e-01, -1.55443575e+00,
        1.80057532e-01,  7.40761752e-01, -3.18789085e-01, -4.63604456e-01,
       -1.11937226e-01,  2.37746093e+00,  3.26199560e-01,  1.85410252e+00,
        1.09455384e+00,  7.92164174e-01, -8.38453117e-01, -1.11207350e-01,
        2.21756724e+00,  9.23484234e-01,  2.51504547e-01, -1.14820044e+00,
        1.51094517e+00,  4.84928368e-01,  3.55082526e-02,  3.38848589e-02,
       -7.48918222e-01, -3.75440673e-01,  1.26261884e+00, -2.43398222e-01,
       -1.76750668e+00, -3.16514648e-01, -1.51939831e+00,  1.13864084e+00,
        4.50805264e-01, -7.02822661e-01,  8.61050155e-01,  1.59017451e+00,
       -9.25629005e-01, -2.98139731e-01, -2.10802506e-02, -6.76127760e-01,
       -1.06780394e+00,  4.73526347e-01,  6.84713532e-02, -6.75741082e-01,
        1.70189977e-01, -5.74802815e-01, -5.10229708e-01, -6.15922547e-01,
        1.40289686e+00,  6.33873632e-01,  5.11812518e-01,  3.14622754e-01,
       -2.87030508e-02,  2.26617158e+00,  5.53793829e-01, -3.97751661e-01,
        4.42244045e-01,  1.34454803e+00, -2.46100971e-01,  1.47286067e+00,
       -8.52871154e-01, -5.50666780e-01,  2.53356783e+00,  2.63988765e-01,
       -1.14591946e+00, -9.16852297e-01,  1.22800266e+00,  7.03021535e-01,
       -4.45823815e-01, -2.22372738e+00,  7.26467140e-01, -1.55033557e+00,
       -2.20023956e-01, -1.41387304e-01,  6.45116608e-01, -2.79453571e-01,
        2.79013741e-01,  1.11457867e-01, -5.19500095e-01,  6.86849128e-02,
       -2.75615678e+00,  2.51774066e-01,  7.96153102e-01, -4.71986851e-02,
       -1.51224067e-01,  3.12914026e-01, -1.48316705e+00, -8.04214656e-01,
        1.37789658e-01,  5.32463763e-01, -1.25356886e+00, -6.49252268e-01,
       -4.44123040e-01, -8.91308260e-02, -9.78464151e-01,  5.67690761e-01,
       -3.61384346e-01, -9.56982179e-02,  3.37025876e-01,  5.29935544e-01,
       -1.34295735e+00,  7.15190610e-01, -6.70588173e-01, -1.49045649e+00,
       -1.00316987e+00, -7.87514064e-01, -8.25129707e-01,  3.38203043e-01,
        8.93942995e-01,  5.80586944e-01,  8.20595063e-01,  5.96253771e-02,
        4.32566615e-01,  1.52696496e+00, -1.67151026e+00, -1.51888632e+00,
        1.75163772e+00,  1.24660585e+00,  4.36577188e-02, -1.23717929e+00,
        1.29841838e-01, -8.59843760e-01,  6.31751230e-01, -9.22467570e-01,
       -8.94859221e-01, -4.10865729e-01, -1.32411375e+00,  7.16883421e-01,
       -3.17879204e-01,  1.34311121e+00, -5.15019492e-01, -3.42192813e-01,
       -5.77828136e-01, -6.55507202e-02,  2.61833784e-01, -1.27735527e+00,
       -3.88415622e-01,  7.23410565e-01,  6.28075887e-01,  7.09955336e-01,
        6.16195422e-01,  1.71486796e-01,  3.31634208e-01,  1.68691355e+00,
        2.42064620e+00,  2.22391900e+00, -1.59545424e+00,  8.72979385e-01,
       -1.90654182e+00,  1.79753525e+00, -3.65544972e-01,  2.70434623e-02,
       -1.75061358e-01,  4.44523405e-01,  5.84006832e-01,  1.72753624e-01,
       -1.01064332e+00,  7.18915654e-01, -1.01773861e+00,  1.17385167e-01,
        2.72789671e+00,  7.48507222e-01,  7.40650850e-02, -1.79556659e-01,
       -1.36527889e-01, -8.31284377e-01,  1.99930279e-01,  6.65496219e-01,
        5.47541558e-01,  3.05051349e-01,  2.63720362e-01, -5.32736274e-02,
        1.30916846e+00,  1.29244705e+00,  5.09797292e-02,  5.32126987e-01,
       -4.81242213e-01,  3.38752518e-01,  1.67776995e+00,  3.47389525e-01,
       -1.39200392e+00,  5.79273928e-01, -1.24659822e+00, -1.45997526e+00,
       -8.76862422e-01, -9.54894503e-01,  1.06096336e+00, -2.84980057e-01,
        1.30775387e+00,  3.38137016e-01, -9.72464186e-01,  6.71069201e-01,
       -4.95631606e-01, -1.95188194e-01, -1.02061576e+00, -7.12702952e-01,
        1.40425607e+00, -2.95041334e-01, -1.67639752e+00, -8.83438004e-01,
       -6.23695995e-02, -5.56698596e-01,  9.38942060e-01,  1.07276169e+00,
        6.00361168e-01,  1.64427360e-01,  2.50937657e-01,  2.08292696e+00,
        1.02400255e-01, -1.73099270e-02,  4.62490037e-01,  8.49998266e-01,
       -9.42294090e-01, -8.32319494e-01,  1.98208641e+00,  1.12756143e+00,
       -9.26400077e-02, -2.88480491e-01,  7.68925371e-01,  7.02050670e-01,
        1.48646233e+00, -4.00423128e-01, -3.57667205e-01,  5.29091117e-01,
        5.71279399e-02, -1.15274570e+00,  8.73381768e-01, -2.22835464e+00,
       -1.32935626e+00, -2.08020072e-01,  1.42108143e+00,  2.47167327e-01,
       -4.61898572e-01,  4.25982244e-01, -7.80627726e-01, -6.41146490e-02,
        6.18831517e-01, -1.10175135e+00, -9.05690892e-01, -3.12022597e-01,
        1.30864522e-01,  2.44195683e-01, -3.53752137e-01, -4.06190232e-01,
        2.00471869e+00, -8.65117734e-01, -1.15547267e+00, -1.33730242e+00,
        8.60164178e-01, -3.38870928e-01, -1.41842923e+00, -2.68190025e-01,
        7.15966985e-01, -8.00409914e-01, -1.59334684e+00,  2.54230818e-02,
        4.55322988e-02, -1.37209712e-01,  4.83819798e-01, -2.42271120e-01,
       -8.79147396e-01, -1.18836261e+00, -7.74883606e-01,  7.76809462e-02,
       -4.11827410e-01,  6.69850177e-01,  4.46180852e-01, -2.24000545e-01,
        3.25707248e-01,  1.52274309e-02,  1.16900013e+00, -1.65567911e-01,
       -3.15325613e-01,  1.39264938e+00,  3.27588771e-01,  8.15474855e-01,
        1.70092153e+00,  1.47279888e+00,  9.56209823e-01,  1.40886799e+00,
       -1.16635859e+00,  1.22527283e+00, -1.14774679e-01, -1.16845526e+00,
        1.93717107e+00, -2.37488441e-01, -8.76379843e-02,  1.17748583e+00,
       -3.22327197e-01,  1.57672345e-01, -2.08229510e+00, -1.78266571e+00,
        3.55500311e-01, -4.63246187e-02, -6.81914591e-01,  7.08045304e-02,
        3.82277343e-01, -1.52290244e-01,  8.05856896e-01, -3.76699457e-02,
        3.57829061e-01, -8.41293015e-01,  2.55400903e-01, -1.22726535e+00,
       -4.61945760e-01, -3.97383125e-01,  1.53482419e+00, -1.39266084e+00,
        1.12973486e+00,  7.31406023e-01,  4.77314443e-01, -1.34596937e+00,
        1.17193953e+00, -1.68044964e+00,  3.27054458e-02, -1.25451831e-01,
        6.46519697e-01,  1.20319441e+00,  6.36436167e-01, -8.67064612e-01,
       -7.63530545e-01, -1.49813239e+00, -1.66208247e-01, -1.60329512e+00,
       -5.84466291e-02,  1.03215240e+00,  8.57353944e-01, -2.93222814e-01,
        1.88991858e+00,  9.58948347e-01,  6.34938928e-01,  8.87420632e-01,
        5.24606765e-01,  2.25732025e-01,  1.33607179e-01, -3.33616813e-02,
       -1.61516413e+00,  2.54986778e+00,  1.47665553e-01, -7.07804323e-01,
       -8.30843711e-01, -1.98471698e+00,  2.03053234e-01,  1.65163243e+00,
       -2.68766892e-01,  1.66224756e+00, -3.83700340e-02, -1.69831476e-01,
       -5.20534873e-01, -7.97670326e-01, -1.42722001e+00, -1.30379975e+00,
        4.29244134e-01, -2.65208539e+00, -1.92667272e+00, -4.93794878e-01,
        5.60652052e-01,  1.93303659e-01,  9.80622703e-01, -8.03041104e-01,
        4.20992673e-01,  1.89431277e+00,  1.98129329e+00,  2.30118076e+00,
       -2.28804956e+00, -2.87957319e-01,  1.26891386e+00, -1.40904956e-01,
       -7.65681403e-01,  7.73410205e-02, -3.27037969e-01, -4.41147996e-01,
       -1.15110075e+00, -8.06103220e-01, -1.13630118e+00,  4.35752221e-01,
       -3.58321377e-01,  3.65750614e-01, -1.52076712e-01, -2.80612024e-01,
       -1.17331324e+00,  4.19800670e-01,  2.26093430e+00, -4.01727379e-01,
       -4.36188396e-01,  1.08520250e+00,  6.86516600e-01,  2.71638002e+00,
       -4.97434142e-01,  1.30058713e+00, -3.78195359e-01, -1.05916233e+00,
       -2.00165944e-01,  3.70359301e-01,  1.92472416e+00,  3.67477101e-01,
       -2.83947463e-01, -3.36936194e-01, -2.05411176e-01,  1.04384258e+00,
        2.56887858e+00,  6.85549185e-01, -1.02071449e+00,  1.25833897e+00,
       -3.05101129e-01,  9.03135998e-01,  5.93036504e-01, -9.97144987e-01,
        4.34001191e-01,  1.00543634e+00, -5.63335235e-01,  9.54553894e-01,
       -2.83283209e+00,  3.34042288e+00, -3.71504688e-01, -1.51901393e+00,
        2.82032345e-01,  6.05582013e-01,  8.32277082e-01, -6.16033389e-01,
       -1.63196301e+00,  1.81480713e+00,  8.22462066e-02, -3.26155172e-01,
       -1.41122103e+00,  1.34199776e+00,  1.07310778e+00, -1.29425229e+00,
       -9.13172343e-01, -5.08783591e-01, -1.65015916e+00,  2.29729704e-01,
        2.55934817e-01, -6.42130741e-01, -1.42951470e+00, -5.49136475e-01,
        2.46079237e-01,  1.17673143e-01, -1.86540702e+00,  1.46409435e+00,
        4.57645355e-01, -9.03297266e-01, -2.63628420e+00,  1.10145458e+00,
       -1.02500970e+00, -6.95701826e-01,  6.62899921e-01,  1.07255337e+00,
        2.62990037e+00, -2.43350592e-02, -1.01182541e+00, -3.59976721e-01,
        5.18422376e-01, -9.97600036e-01, -1.27071838e+00,  9.72829118e-01,
        1.44324580e+00,  7.97551069e-02,  6.20839012e-01, -5.46879407e-01,
        2.60718205e-02, -4.71642117e-01,  2.89584907e-01,  1.27109761e+00,
       -3.28638946e-01,  5.92375811e-01,  7.73991197e-01,  1.38780942e+00,
       -9.68826747e-01,  1.72240393e-01, -2.12906199e-01,  1.51739398e+00,
        5.75680204e-01,  2.83997257e-01,  1.83574765e+00, -2.68281707e-01,
       -5.15566199e-01, -1.64537678e+00,  5.35921843e-01,  1.33087034e-03,
        2.29693226e+00, -2.30549045e+00, -1.63329975e+00, -2.38352074e-01,
        3.97514479e-01, -5.35784326e-01,  4.06388186e-01,  6.61302535e-01,
        1.20042699e-01, -1.72260465e-01,  1.27274498e-01,  7.98903127e-01,
       -3.50686641e-02, -7.41985986e-01,  9.48739130e-01,  1.91300626e-01,
        2.28877522e+00, -9.08695895e-01,  4.01055442e-01,  7.20183501e-01,
        7.64121018e-01, -2.60949865e-01, -4.83967152e-01,  1.05653574e+00,
       -1.08771276e+00, -9.94612562e-01,  3.44456135e-01,  1.19098967e+00,
       -1.71116496e-01,  1.39841839e+00,  5.27358440e-01, -1.26138898e+00,
       -1.00813952e+00,  5.84524688e-01,  6.13581289e-01, -7.63584985e-01,
        4.72931514e-01, -1.33359152e+00, -5.32341636e-01,  5.50553615e-01,
        9.44678944e-02,  1.96539865e-01, -1.33881614e+00,  1.19188649e+00,
       -9.46193394e-01,  4.82793004e-02,  4.28343322e-01, -1.03985717e-01,
        1.16097355e+00, -6.03963457e-01, -9.21224387e-01,  4.31383930e-01,
        1.38295235e-01, -2.68287857e-01,  2.50762886e-01,  4.83930508e-01])

In [ ]:
cats = pd.qcut(data, 4)
cats

[(-2.884, -0.655], (0.0368, 0.645], (0.0368, 0.645], (0.0368, 0.645], (0.0368, 0.645], ..., (0.0368, 0.645], (0.0368, 0.645], (-0.655, 0.0368], (0.0368, 0.645], (0.0368, 0.645]]
Length: 1000
Categories (4, interval[float64]): [(-2.884, -0.655] < (-0.655, 0.0368] < (0.0368, 0.645] <
                                    (0.645, 3.34]]

In [ ]:
pd.value_counts(cats)

(0.645, 3.34]       250
(0.0368, 0.645]     250
(-0.655, 0.0368]    250
(-2.884, -0.655]    250
dtype: int64

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-2.884, -1.308], (0.0368, 1.308], (0.0368, 1.308], (0.0368, 1.308], (0.0368, 1.308], ..., (0.0368, 1.308], (0.0368, 1.308], (-1.308, 0.0368], (0.0368, 1.308], (0.0368, 1.308]]
Length: 1000
Categories (4, interval[float64]): [(-2.884, -1.308] < (-1.308, 0.0368] < (0.0368, 1.308] <
                                    (1.308, 3.34]]

Detecting and Filtering Outliers

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003496    -0.024812     0.013831     0.017754
std       1.020637     0.964646     1.001991     1.039345
min      -3.319632    -2.746873    -2.937585    -3.236989
25%      -0.684950    -0.692293    -0.658941    -0.696265
50%       0.025699    -0.034771     0.028350     0.026460
75%       0.680086     0.602843     0.673422     0.702358
max       2.792050     3.240992     2.854936     3.187548

In [ ]:
col = data[2]
col

0     -0.500468
1     -2.418381
2     -1.125190
3      0.494669
4      0.383966
         ...
995   -0.254010
996    0.330611
997   -0.566959
998    0.292194
999   -0.196394
Name: 2, Length: 1000, dtype: float64

In [ ]:
col[np.abs(col) > 3]

Series([], Name: 2, dtype: float64)

In [ ]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
27  -3.032431  0.982363  0.420821 -0.725170
79  -3.319632 -0.696949 -1.471452  0.982392
163 -0.604932  3.040109 -1.583842  0.071007
428  0.029215  3.240992  0.927275  0.259363
506 -0.191844  0.058206 -0.522289 -3.236989
557 -0.466685 -0.689802 -0.928583  3.187548
668  0.186732  0.591386 -0.503375 -3.063693
677 -3.106264 -1.079553 -0.197498 -0.839421
848 -3.137855  0.307895  0.288383  0.566518
905 -3.282227  0.542434 -0.207736  0.084830
918 -3.299936  2.176485 -0.621862 -1.265093
978  0.909792  0.385587 -0.580945 -3.072488

In [ ]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002317    -0.025093     0.013831     0.017940
std       1.017018     0.963733     1.001991     1.037672
min      -3.000000    -2.746873    -2.937585    -3.000000
25%      -0.684950    -0.692293    -0.658941    -0.696265
50%       0.025699    -0.034771     0.028350     0.026460
75%       0.680086     0.602843     0.673422     0.702358
max       2.792050     3.000000     2.854936     3.000000

In [ ]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0  1.0
4  1.0  1.0  1.0 -1.0

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
sampler = np.random.permutation(5)
sampler

array([4, 0, 2, 3, 1])

In [ ]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [ ]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [ ]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [ ]:
draws = choices.sample(n=10, replace=True)
draws

1    7
3    6
2   -1
1    7
3    6
0    5
1    7
2   -1
4    4
2   -1
dtype: int64

Computing Indicator/Dummy Variables

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [ ]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id', 'title', 'genres']
mnames

['movie_id', 'title', 'genres']

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_tables('/content/movie.dat', sep='::', header=None, names=mnames)
movies[:10]

AttributeError: ignored